Tekla Open API Reference for Tekla Structures 2025
DistanceList.CopyTo Method
 Copies the contents of the list to an array.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void CopyTo(
	Distance[] array,
	int arrayIndex
)
Public Sub CopyTo (
	array As Distance(),
	arrayIndex As Integer
)
Parameters
array
Type: Tekla.Structures.Datatype.Distance[]
The target array.
arrayIndex
Type: System.Int32
The starting index in the array.
Implements
ICollection<T>.CopyTo(T[], Int32)
Examples
 This example shows how to copy the Distance instances in a DistanceList to an array.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // We'll use this distance list to demonstrate the CopyTo method.
           DistanceList distanceList = new DistanceList(new Distance[]
                                                       {
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(30.2),
                                                           new Distance(50),
                                                           new Distance(2.3),
                                                           new Distance(2.3),
                                                       });
           Distance[] array = new Distance[distanceList.Count];
           distanceList.CopyTo(array, 0);
       }
}
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace